Тест/Тест/src/InformationRegisters/ДополнительныеНомера/ДополнительныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНомера</name>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПланНаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Добавочный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.Roistat_Сделки</registerRecords>
  <attributes>
    <name>КлиентНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролёр</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКонтроля</name>
    <type>
      <types>EnumRef.СтатусыКонтроляЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Канал</name>
    <type>
      <types>CatalogRef.ИсточникиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ТипЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредлагаемойЦены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоВзаимодействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прослушано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АтоматическоеСоздание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целевая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодстатусОбработки</name>
    <type>
      <types>EnumRef.ПодстатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>WTPanel</name>
    <type>
      <types>CatalogRef.СтатусыWT</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРеагированияНаЗаявку</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОригинала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредлагаемаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.дт_РолиВПродаже</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/CommonForms/РейтингКладовщиков/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	РейтингМенеджеров.Параметры.УстановитьЗначениеПараметра("ВидРасхода",Справочники.ВидыРасходов.НайтиПоКоду("000000041"));
	
	элементы.РейтингМенеджеровКонтроль.Доступность = Пользователи.РолиДоступны("ПолныеПрава,РОП");
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РейтингМенеджеров.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	РейтингМенеджеров.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	//РейтингМенеджеров.Параметры.УстановитьЗначениеПараметра("ВидРасхода",Справочники.ВидыРасходов.НайтиПоКоду("000000041"));
	
	СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	
	заявки.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	заявки.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);

	ПоказателиКладовщиков.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	ПоказателиКладовщиков.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	

	ЗаполнениеПодвала();
	
	///+ГомзМА 03.03.2023
	ЭтаФорма.Модифицированность = Ложь;
	///-ГомзМА 03.03.2023
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СсылкаДляОткрытия    = Элементы.СписокСчета.ТекущиеДанные[СтрЗаменить(Поле.Имя,Элемент.имя,"")];
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	Если ТипЗнч(СсылкаДляОткрытия)=тип("ДокументСсылка.ПриходДенегНасчет") Тогда
		ИмяФормыДокумента="Документ.ПриходДенегНасчет.Форма.ФормаДокумента";
	ИначеЕсли ТипЗнч(СсылкаДляОткрытия)=тип("ДокументСсылка.ЗаказКлиента") Тогда
		ИмяФормыДокумента="Документ.ЗаказКлиента.Форма.ФормаДокумента";
	ИначеЕсли ТипЗнч(СсылкаДляОткрытия)=тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		ИмяФормыДокумента="Документ.ПродажаЗапчастей.Форма.ФормаДокумента";
	ИначеЕсли ТипЗнч(СсылкаДляОткрытия)=тип("ДокументСсылка.ПредварительныйСчет") Тогда
		ИмяФормыДокумента="Документ.ПредварительныйСчет.Форма.ФормаДокумента";
	Иначе
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормы);
	ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	РейтингМенеджеров.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	РейтингМенеджеров.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	
	СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	
	заявки.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	заявки.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	
	
	ПоказателиКладовщиков.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	ПоказателиКладовщиков.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ЗаполнениеПодвала();
	
КонецПроцедуры

Процедура ЗаполнениеПодвала()
    Схема = Элементы.ПоказателиКладовщиков.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.ПоказателиКладовщиков.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковКомплектовка.ГоризонтальноеПоложениеВПодвале    = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковПоступления.ГоризонтальноеПоложениеВПодвале 	  = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковКарточки.ГоризонтальноеПоложениеВПодвале   	  = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковСрЦена.ГоризонтальноеПоложениеВПодвале 	 	  = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковЦена.ГоризонтальноеПоложениеВПодвале 	 		  = ГоризонтальноеПоложениеЭлемента.Право;
	
		
    ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковКомплектовка.ТекстПодвала =  Формат(Результат.Итог("Комплектовка"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковПоступления.ТекстПодвала  =  Формат(Результат.Итог("Поступления"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковКарточки.ТекстПодвала     =  Формат(Результат.Итог("Карточки"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковСрЦена.ТекстПодвала 	    =  Формат(Результат.Итог("СрЦена"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ПоказателиКладовщиковЦена.ТекстПодвала 	    =  Формат(Результат.Итог("Цена"),"ЧДЦ=0; ЧН=-");
	КонецПроцедуры

&НаКлиенте
Процедура РейтингМенеджеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.имя = "РейтингМенеджеровКонтроль" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.РейтингМенеджеров.ТекущиеДанные;
		ТекущийМенеджер = Элементы.РейтингМенеджеров.ТекущиеДанные.Менеджер;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Контроль Тогда
				СнятьКонтроль(ТекущийМенеджер);
			Иначе
				ПоставитьКонтроль(ТекущийМенеджер);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	//Параметр в динамическом списке нужно обновить
	//Список.Параметры.УстановитьЗначениеПараметра("ВыбраннаяЗапись", ВыбраннаяЗапись);
	
	Элементы.РейтингМенеджеров.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СнятьКонтроль(Менеджер)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеНомера.Добавочный КАК Добавочный,
	|	ДополнительныеНомера.Менеджер КАК Менеджер,
	|	ДополнительныеНомера.Контроль КАК Контроль
	|ИЗ
	|	РегистрСведений.ДополнительныеНомера КАК ДополнительныеНомера
	|ГДЕ
	|	ДополнительныеНомера.Менеджер = &Менеджер";
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	Выборка = запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Запись = РегистрыСведений.ДополнительныеНомера.СоздатьМенеджерЗаписи();
	Запись.Менеджер   = Выборка.Менеджер;
	Запись.Добавочный = Выборка.Добавочный;
	Запись.Контроль   = Ложь;
	
	Запись.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПоставитьКонтроль(Менеджер)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеНомера.Добавочный КАК Добавочный,
	|	ДополнительныеНомера.Менеджер КАК Менеджер,
	|	ДополнительныеНомера.Контроль КАК Контроль
	|ИЗ
	|	РегистрСведений.ДополнительныеНомера КАК ДополнительныеНомера
	|ГДЕ
	|	ДополнительныеНомера.Менеджер = &Менеджер";
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	Выборка = запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Запись = РегистрыСведений.ДополнительныеНомера.СоздатьМенеджерЗаписи();
	Запись.Менеджер   = Выборка.Менеджер;
	Запись.Добавочный = Выборка.Добавочный;
	Запись.Контроль   = Истина;
	
	Запись.Записать();
	
КонецПроцедуры
